import matplotlib.pyplot as plt

X_1 = [4.4, 4.45, 4.47, 4.48, 4.55, 3.95, 3.94, 3.6]
Y_1 = [10000, 12000, 16000, 15500, 30000, 4000, 3700, 3200]
X_2 = [1.1, 1.135, 1.2, 1.22, 1.24, 1.25, 1.33, 1.35, 1.42, 2, 1.44, 1.46, 1.48, 1.5, 1.52, 1.54, 1.56, 1.58, 1.6, 1.62, 1.64, 1.66, 1.68, 1.7, 1.72, 1.74, 1.76, 1.78, 1.8, 1.82, 1.84, 1.86, 1.88, 1.9]
Y_2 = [10, 14, 25, 29, 31, 33, 50, 60, 80, 500, 88, 103, 118, 133, 148, 163, 164, 183, 208, 223, 240, 253, 270, 290, 298, 320, 321, 333, 350,360, 310, 350, 420, 433]

X_3 = [1.92, 1.94, 1.96, 1.98, 2.1, 2.15, 2.2, 2.21, 2.14, 4, 3.43, 3.35, 3.3, 3.25, 3.07, 2.7, 2.2, 2.22, 2.25, 2.3, 2.4, 2.6]
Y_3 = [448, 463, 478, 493, 540, 900, 650, 700, 800, 3000, 1800, 2500, 2000, 1700, 1000, 1000, 800, 900, 900, 1000, 1000, 800]
#график ударной адиабаты алюминия

plt.scatter(X_1, Y_1,  marker='s')

plt.scatter(X_2, Y_2,  marker='+')
plt.scatter(X_3, Y_3,  marker='o')
#plt.scatter(X_2, Y_2,  marker='*')
#plt.scatter(X_2, Y_2,  marker='h')
#plt.scatter(X_2, Y_2,  marker='X')
#plt.scatter(X_2, Y_2,  marker='D')
#plt.scatter(X_2, Y_2,  marker='_')
#plt.scatter(X_2, Y_2,  marker='v')
#plt.scatter(X_2, Y_2,  marker='P')

#диапазон осей
plt.xlim(1,5)
plt.ylim(1,10000000)
plt.yscale('log')
#заголовки
plt.title('Экспериментальные данные по ударному сжатию алюминия')
#метки x и y
plt.xlabel('sigma')
plt.ylabel('P, GPa')
#отображение графика
plt.show()